logs/scenario5_20250613_122527.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: scenarios/scenario5_large_file_handling.js
        output: -

     scenarios: (100.00%) 1 scenario, 3 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 3 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 3/3 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 3 VUs  0m01.0s/1m0s

running (0m02.0s), 3/3 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 3 VUs  0m02.0s/1m0s

running (0m03.0s), 3/3 VUs, 0 complete and 0 interrupted iterations
default   [   5% ] 3 VUs  0m03.0s/1m0s

running (0m04.0s), 3/3 VUs, 0 complete and 0 interrupted iterations
default   [   7% ] 3 VUs  0m04.0s/1m0s

running (0m05.0s), 3/3 VUs, 0 complete and 0 interrupted iterations
default   [   8% ] 3 VUs  0m05.0s/1m0s

running (0m08.9s), 3/3 VUs, 0 complete and 0 interrupted iterations
default   [  10% ] 3 VUs  0m06.0s/1m0s

running (0m09.9s), 3/3 VUs, 0 complete and 0 interrupted iterations
default   [  12% ] 3 VUs  0m07.0s/1m0s

running (0m10.9s), 3/3 VUs, 0 complete and 0 interrupted iterations
default   [  13% ] 3 VUs  0m08.0s/1m0s
time="2025-06-13T12:25:40Z" level=info msg="[DEBUG 2025-06-13T12:25:40.294Z] Starting upload of small-100KB.txt (102400 bytes)" source=console
time="2025-06-13T12:25:40Z" level=info msg="[DEBUG 2025-06-13T12:25:40.294Z] Using pre-loaded file content, size: undefined bytes" source=console
time="2025-06-13T12:25:40Z" level=info msg="[DEBUG 2025-06-13T12:25:40.295Z] HTTP request prepared, sending to https://axxessio.wyswyg.in/api/v1/files/?type=chat" source=console

running (0m11.9s), 3/3 VUs, 0 complete and 0 interrupted iterations
default   [  15% ] 3 VUs  0m09.0s/1m0s
time="2025-06-13T12:25:41Z" level=info msg="[DEBUG 2025-06-13T12:25:41.203Z] Starting upload of small-100KB.txt (102400 bytes)" source=console
time="2025-06-13T12:25:41Z" level=info msg="[DEBUG 2025-06-13T12:25:41.204Z] Using pre-loaded file content, size: undefined bytes" source=console
time="2025-06-13T12:25:41Z" level=info msg="[DEBUG 2025-06-13T12:25:41.204Z] HTTP request prepared, sending to https://axxessio.wyswyg.in/api/v1/files/?type=chat" source=console

running (0m12.9s), 3/3 VUs, 0 complete and 0 interrupted iterations
default   [  17% ] 3 VUs  0m10.0s/1m0s

running (0m13.9s), 3/3 VUs, 0 complete and 0 interrupted iterations
default   [  18% ] 3 VUs  0m11.0s/1m0s
time="2025-06-13T12:25:43Z" level=info msg="[DEBUG 2025-06-13T12:25:43.239Z] Starting upload of small-100KB.txt (102400 bytes)" source=console
time="2025-06-13T12:25:43Z" level=info msg="[DEBUG 2025-06-13T12:25:43.239Z] Using pre-loaded file content, size: undefined bytes" source=console
time="2025-06-13T12:25:43Z" level=info msg="[DEBUG 2025-06-13T12:25:43.240Z] HTTP request prepared, sending to https://axxessio.wyswyg.in/api/v1/files/?type=chat" source=console

running (0m14.9s), 3/3 VUs, 0 complete and 0 interrupted iterations
default   [  20% ] 3 VUs  0m12.0s/1m0s

running (0m15.9s), 3/3 VUs, 0 complete and 0 interrupted iterations
default   [  22% ] 3 VUs  0m13.0s/1m0s
time="2025-06-13T12:25:45Z" level=info msg="[DEBUG 2025-06-13T12:25:45.658Z] Upload successful for small-100KB.txt, took 5362ms, file ID: d587a8b1-0e4b-487e-8fac-93a495ec8c29" source=console

running (0m16.9s), 3/3 VUs, 1 complete and 0 interrupted iterations
default   [  23% ] 3 VUs  0m14.0s/1m0s

running (0m17.9s), 3/3 VUs, 1 complete and 0 interrupted iterations
default   [  25% ] 3 VUs  0m15.0s/1m0s
time="2025-06-13T12:25:47Z" level=info msg="[DEBUG 2025-06-13T12:25:47.251Z] Upload successful for small-100KB.txt, took 6047ms, file ID: 05789c2e-3972-4931-9793-ee6f9dd8dff7" source=console

running (0m18.9s), 3/3 VUs, 2 complete and 0 interrupted iterations
default   [  27% ] 3 VUs  0m16.0s/1m0s

running (0m19.9s), 3/3 VUs, 2 complete and 0 interrupted iterations
default   [  28% ] 3 VUs  0m17.0s/1m0s
time="2025-06-13T12:25:48Z" level=info msg="[DEBUG 2025-06-13T12:25:48.887Z] Upload successful for small-100KB.txt, took 5646ms, file ID: 57f628e9-d31f-4078-af6c-4d8f98fe1938" source=console

running (0m20.9s), 3/3 VUs, 3 complete and 0 interrupted iterations
default   [  30% ] 3 VUs  0m18.0s/1m0s

running (0m21.9s), 3/3 VUs, 3 complete and 0 interrupted iterations
default   [  32% ] 3 VUs  0m19.0s/1m0s

running (0m22.9s), 3/3 VUs, 3 complete and 0 interrupted iterations
default   [  33% ] 3 VUs  0m20.0s/1m0s

running (0m23.9s), 3/3 VUs, 3 complete and 0 interrupted iterations
default   [  35% ] 3 VUs  0m21.0s/1m0s

running (0m24.9s), 3/3 VUs, 3 complete and 0 interrupted iterations
default   [  37% ] 3 VUs  0m22.0s/1m0s

running (0m25.9s), 3/3 VUs, 3 complete and 0 interrupted iterations
default   [  38% ] 3 VUs  0m23.0s/1m0s

running (0m26.9s), 3/3 VUs, 3 complete and 0 interrupted iterations
default   [  40% ] 3 VUs  0m24.0s/1m0s

running (0m27.9s), 3/3 VUs, 3 complete and 0 interrupted iterations
default   [  42% ] 3 VUs  0m25.0s/1m0s
time="2025-06-13T12:25:56Z" level=info msg="[DEBUG 2025-06-13T12:25:56.848Z] Starting upload of small-100KB.txt (102400 bytes)" source=console
time="2025-06-13T12:25:56Z" level=info msg="[DEBUG 2025-06-13T12:25:56.848Z] Using pre-loaded file content, size: undefined bytes" source=console
time="2025-06-13T12:25:56Z" level=info msg="[DEBUG 2025-06-13T12:25:56.848Z] HTTP request prepared, sending to https://axxessio.wyswyg.in/api/v1/files/?type=chat" source=console
time="2025-06-13T12:25:57Z" level=info msg="[DEBUG 2025-06-13T12:25:57.273Z] Starting upload of small-100KB.txt (102400 bytes)" source=console
time="2025-06-13T12:25:57Z" level=info msg="[DEBUG 2025-06-13T12:25:57.273Z] Using pre-loaded file content, size: undefined bytes" source=console
time="2025-06-13T12:25:57Z" level=info msg="[DEBUG 2025-06-13T12:25:57.274Z] HTTP request prepared, sending to https://axxessio.wyswyg.in/api/v1/files/?type=chat" source=console

running (0m28.9s), 3/3 VUs, 3 complete and 0 interrupted iterations
default   [  43% ] 3 VUs  0m26.0s/1m0s

running (0m29.9s), 3/3 VUs, 3 complete and 0 interrupted iterations
default   [  45% ] 3 VUs  0m27.0s/1m0s
time="2025-06-13T12:25:58Z" level=info msg="[DEBUG 2025-06-13T12:25:58.770Z] Starting upload of small-100KB.txt (102400 bytes)" source=console
time="2025-06-13T12:25:58Z" level=info msg="[DEBUG 2025-06-13T12:25:58.770Z] Using pre-loaded file content, size: undefined bytes" source=console
time="2025-06-13T12:25:58Z" level=info msg="[DEBUG 2025-06-13T12:25:58.770Z] HTTP request prepared, sending to https://axxessio.wyswyg.in/api/v1/files/?type=chat" source=console

running (0m30.9s), 3/3 VUs, 3 complete and 0 interrupted iterations
default   [  47% ] 3 VUs  0m28.0s/1m0s

running (0m31.9s), 3/3 VUs, 3 complete and 0 interrupted iterations
default   [  48% ] 3 VUs  0m29.0s/1m0s
time="2025-06-13T12:26:01Z" level=info msg="[DEBUG 2025-06-13T12:26:01.330Z] Upload successful for small-100KB.txt, took 4482ms, file ID: e4d0c748-f5dd-42de-95e1-cb49b4953e38" source=console

running (0m32.9s), 3/3 VUs, 4 complete and 0 interrupted iterations
default   [  50% ] 3 VUs  0m30.0s/1m0s
time="2025-06-13T12:26:02Z" level=info msg="[DEBUG 2025-06-13T12:26:02.504Z] Upload FAILED for small-100KB.txt: Status 500" source=console
time="2025-06-13T12:26:02Z" level=info msg="[DEBUG 2025-06-13T12:26:02.504Z] Response body: {\"detail\":\"Failed to convert file to PDF\"}" source=console

running (0m33.9s), 3/3 VUs, 5 complete and 0 interrupted iterations
default   [  52% ] 3 VUs  0m31.0s/1m0s
time="2025-06-13T12:26:03Z" level=info msg="[DEBUG 2025-06-13T12:26:03.207Z] Upload successful for small-100KB.txt, took 4436ms, file ID: a6f656d5-28e4-4329-8b72-510ce83ce962" source=console

running (0m34.9s), 3/3 VUs, 6 complete and 0 interrupted iterations
default   [  53% ] 3 VUs  0m32.0s/1m0s

running (0m35.9s), 3/3 VUs, 6 complete and 0 interrupted iterations
default   [  55% ] 3 VUs  0m33.0s/1m0s

running (0m36.9s), 3/3 VUs, 6 complete and 0 interrupted iterations
default   [  57% ] 3 VUs  0m34.0s/1m0s

running (0m37.9s), 3/3 VUs, 6 complete and 0 interrupted iterations
default   [  58% ] 3 VUs  0m35.0s/1m0s

running (0m38.9s), 3/3 VUs, 6 complete and 0 interrupted iterations
default   [  60% ] 3 VUs  0m36.0s/1m0s

running (0m39.9s), 3/3 VUs, 6 complete and 0 interrupted iterations
default   [  62% ] 3 VUs  0m37.0s/1m0s

running (0m43.9s), 3/3 VUs, 6 complete and 0 interrupted iterations
default   [  63% ] 3 VUs  0m38.0s/1m0s
time="2025-06-13T12:26:12Z" level=info msg="[DEBUG 2025-06-13T12:26:12.716Z] Starting upload of small-100KB.txt (102400 bytes)" source=console
time="2025-06-13T12:26:12Z" level=info msg="[DEBUG 2025-06-13T12:26:12.717Z] Using pre-loaded file content, size: undefined bytes" source=console
time="2025-06-13T12:26:12Z" level=info msg="[DEBUG 2025-06-13T12:26:12.717Z] HTTP request prepared, sending to https://axxessio.wyswyg.in/api/v1/files/?type=chat" source=console

running (0m44.9s), 3/3 VUs, 6 complete and 0 interrupted iterations
default   [  65% ] 3 VUs  0m39.0s/1m0s
time="2025-06-13T12:26:14Z" level=info msg="[DEBUG 2025-06-13T12:26:14.168Z] Starting upload of small-100KB.txt (102400 bytes)" source=console
time="2025-06-13T12:26:14Z" level=info msg="[DEBUG 2025-06-13T12:26:14.168Z] Using pre-loaded file content, size: undefined bytes" source=console
time="2025-06-13T12:26:14Z" level=info msg="[DEBUG 2025-06-13T12:26:14.168Z] HTTP request prepared, sending to https://axxessio.wyswyg.in/api/v1/files/?type=chat" source=console
time="2025-06-13T12:26:14Z" level=info msg="[DEBUG 2025-06-13T12:26:14.502Z] Starting upload of small-100KB.txt (102400 bytes)" source=console
time="2025-06-13T12:26:14Z" level=info msg="[DEBUG 2025-06-13T12:26:14.502Z] Using pre-loaded file content, size: undefined bytes" source=console
time="2025-06-13T12:26:14Z" level=info msg="[DEBUG 2025-06-13T12:26:14.502Z] HTTP request prepared, sending to https://axxessio.wyswyg.in/api/v1/files/?type=chat" source=console

running (0m45.9s), 3/3 VUs, 6 complete and 0 interrupted iterations
default   [  67% ] 3 VUs  0m40.0s/1m0s

running (0m46.9s), 3/3 VUs, 6 complete and 0 interrupted iterations
default   [  68% ] 3 VUs  0m41.0s/1m0s

running (0m47.9s), 3/3 VUs, 6 complete and 0 interrupted iterations
default   [  70% ] 3 VUs  0m42.0s/1m0s
time="2025-06-13T12:26:17Z" level=info msg="[DEBUG 2025-06-13T12:26:17.456Z] Upload successful for small-100KB.txt, took 4738ms, file ID: d6ad38bd-27f0-4cb3-99ef-fd51d3efff10" source=console

running (0m48.9s), 3/3 VUs, 7 complete and 0 interrupted iterations
default   [  72% ] 3 VUs  0m43.0s/1m0s

running (0m49.9s), 3/3 VUs, 7 complete and 0 interrupted iterations
default   [  73% ] 3 VUs  0m44.0s/1m0s
time="2025-06-13T12:26:18Z" level=info msg="[DEBUG 2025-06-13T12:26:18.957Z] Upload successful for small-100KB.txt, took 4455ms, file ID: e64fd043-5857-43e0-84a2-820f394404f2" source=console

running (0m50.9s), 3/3 VUs, 8 complete and 0 interrupted iterations
default   [  75% ] 3 VUs  0m45.0s/1m0s
time="2025-06-13T12:26:20Z" level=info msg="[DEBUG 2025-06-13T12:26:20.647Z] Upload successful for small-100KB.txt, took 6479ms, file ID: 6f3ab167-a77c-4843-a723-710d922e3007" source=console

running (0m51.9s), 3/3 VUs, 9 complete and 0 interrupted iterations
default   [  77% ] 3 VUs  0m46.0s/1m0s

running (0m52.9s), 3/3 VUs, 9 complete and 0 interrupted iterations
default   [  78% ] 3 VUs  0m47.0s/1m0s

running (0m53.9s), 3/3 VUs, 9 complete and 0 interrupted iterations
default   [  80% ] 3 VUs  0m48.0s/1m0s

running (0m54.9s), 3/3 VUs, 9 complete and 0 interrupted iterations
default   [  82% ] 3 VUs  0m49.0s/1m0s

running (0m55.9s), 3/3 VUs, 9 complete and 0 interrupted iterations
default   [  83% ] 3 VUs  0m50.0s/1m0s

running (0m56.9s), 3/3 VUs, 9 complete and 0 interrupted iterations
default   [  85% ] 3 VUs  0m51.0s/1m0s
time="2025-06-13T12:26:26Z" level=info msg="[DEBUG 2025-06-13T12:26:26.119Z] Starting upload of small-100KB.txt (102400 bytes)" source=console
time="2025-06-13T12:26:26Z" level=info msg="[DEBUG 2025-06-13T12:26:26.119Z] Using pre-loaded file content, size: undefined bytes" source=console
time="2025-06-13T12:26:26Z" level=info msg="[DEBUG 2025-06-13T12:26:26.119Z] HTTP request prepared, sending to https://axxessio.wyswyg.in/api/v1/files/?type=chat" source=console

running (0m57.9s), 3/3 VUs, 9 complete and 0 interrupted iterations
default   [  87% ] 3 VUs  0m52.0s/1m0s

running (0m58.9s), 3/3 VUs, 9 complete and 0 interrupted iterations
default   [  88% ] 3 VUs  0m53.0s/1m0s
time="2025-06-13T12:26:27Z" level=info msg="[DEBUG 2025-06-13T12:26:27.669Z] Starting upload of small-100KB.txt (102400 bytes)" source=console
time="2025-06-13T12:26:27Z" level=info msg="[DEBUG 2025-06-13T12:26:27.669Z] Using pre-loaded file content, size: undefined bytes" source=console
time="2025-06-13T12:26:27Z" level=info msg="[DEBUG 2025-06-13T12:26:27.669Z] HTTP request prepared, sending to https://axxessio.wyswyg.in/api/v1/files/?type=chat" source=console

running (0m59.9s), 3/3 VUs, 9 complete and 0 interrupted iterations
default   [  90% ] 3 VUs  0m54.0s/1m0s
time="2025-06-13T12:26:29Z" level=info msg="[DEBUG 2025-06-13T12:26:29.641Z] Starting upload of small-100KB.txt (102400 bytes)" source=console
time="2025-06-13T12:26:29Z" level=info msg="[DEBUG 2025-06-13T12:26:29.641Z] Using pre-loaded file content, size: undefined bytes" source=console
time="2025-06-13T12:26:29Z" level=info msg="[DEBUG 2025-06-13T12:26:29.642Z] HTTP request prepared, sending to https://axxessio.wyswyg.in/api/v1/files/?type=chat" source=console

running (1m00.9s), 3/3 VUs, 9 complete and 0 interrupted iterations
default   [  92% ] 3 VUs  0m55.0s/1m0s

running (1m01.9s), 3/3 VUs, 9 complete and 0 interrupted iterations
default   [  93% ] 3 VUs  0m56.0s/1m0s
time="2025-06-13T12:26:31Z" level=info msg="[DEBUG 2025-06-13T12:26:31.253Z] Upload FAILED for small-100KB.txt: Status 500" source=console
time="2025-06-13T12:26:31Z" level=info msg="[DEBUG 2025-06-13T12:26:31.253Z] Response body: {\"detail\":\"Failed to convert file to PDF\"}" source=console

running (1m02.9s), 3/3 VUs, 10 complete and 0 interrupted iterations
default   [  95% ] 3 VUs  0m57.0s/1m0s
time="2025-06-13T12:26:31Z" level=info msg="[DEBUG 2025-06-13T12:26:31.910Z] Upload successful for small-100KB.txt, took 4240ms, file ID: a78d99a9-5543-4ff2-98e8-4bfa2f355dab" source=console

running (1m03.9s), 3/3 VUs, 11 complete and 0 interrupted iterations
default   [  97% ] 3 VUs  0m58.0s/1m0s

running (1m04.9s), 3/3 VUs, 11 complete and 0 interrupted iterations
default   [  98% ] 3 VUs  0m59.0s/1m0s
time="2025-06-13T12:26:34Z" level=info msg="[DEBUG 2025-06-13T12:26:34.103Z] Upload successful for small-100KB.txt, took 4460ms, file ID: 386e7eca-3646-4037-a81a-4246c32c99dd" source=console

running (1m05.9s), 3/3 VUs, 12 complete and 0 interrupted iterations
default   [ 100% ] 3 VUs  1m00.0s/1m0s

running (1m06.9s), 3/3 VUs, 12 complete and 0 interrupted iterations
default ↓ [ 100% ] 3 VUs  1m0s

running (1m07.9s), 3/3 VUs, 12 complete and 0 interrupted iterations
default ↓ [ 100% ] 3 VUs  1m0s

running (1m08.9s), 3/3 VUs, 12 complete and 0 interrupted iterations
default ↓ [ 100% ] 3 VUs  1m0s

running (1m09.9s), 3/3 VUs, 12 complete and 0 interrupted iterations
default ↓ [ 100% ] 3 VUs  1m0s

running (1m10.9s), 3/3 VUs, 12 complete and 0 interrupted iterations
default ↓ [ 100% ] 3 VUs  1m0s
time="2025-06-13T12:26:40Z" level=info msg="[DEBUG 2025-06-13T12:26:40.644Z] Starting upload of small-100KB.txt (102400 bytes)" source=console
time="2025-06-13T12:26:40Z" level=info msg="[DEBUG 2025-06-13T12:26:40.644Z] Using pre-loaded file content, size: undefined bytes" source=console
time="2025-06-13T12:26:40Z" level=info msg="[DEBUG 2025-06-13T12:26:40.645Z] HTTP request prepared, sending to https://axxessio.wyswyg.in/api/v1/files/?type=chat" source=console

running (1m11.9s), 3/3 VUs, 12 complete and 0 interrupted iterations
default ↓ [ 100% ] 3 VUs  1m0s
time="2025-06-13T12:26:40Z" level=info msg="[DEBUG 2025-06-13T12:26:40.822Z] Starting upload of small-100KB.txt (102400 bytes)" source=console
time="2025-06-13T12:26:40Z" level=info msg="[DEBUG 2025-06-13T12:26:40.822Z] Using pre-loaded file content, size: undefined bytes" source=console
time="2025-06-13T12:26:40Z" level=info msg="[DEBUG 2025-06-13T12:26:40.822Z] HTTP request prepared, sending to https://axxessio.wyswyg.in/api/v1/files/?type=chat" source=console

running (1m12.9s), 3/3 VUs, 12 complete and 0 interrupted iterations
default ↓ [ 100% ] 3 VUs  1m0s

running (1m13.9s), 3/3 VUs, 12 complete and 0 interrupted iterations
default ↓ [ 100% ] 3 VUs  1m0s

running (1m14.9s), 3/3 VUs, 12 complete and 0 interrupted iterations
default ↓ [ 100% ] 3 VUs  1m0s

running (1m18.8s), 3/3 VUs, 12 complete and 0 interrupted iterations
default ↓ [ 100% ] 3 VUs  1m0s
time="2025-06-13T12:26:48Z" level=info msg="[DEBUG 2025-06-13T12:26:48.447Z] Starting upload of small-100KB.txt (102400 bytes)" source=console
time="2025-06-13T12:26:48Z" level=info msg="[DEBUG 2025-06-13T12:26:48.448Z] Using pre-loaded file content, size: undefined bytes" source=console
time="2025-06-13T12:26:48Z" level=info msg="[DEBUG 2025-06-13T12:26:48.448Z] HTTP request prepared, sending to https://axxessio.wyswyg.in/api/v1/files/?type=chat" source=console

running (1m19.8s), 3/3 VUs, 12 complete and 0 interrupted iterations
default ↓ [ 100% ] 3 VUs  1m0s
time="2025-06-13T12:26:48Z" level=info msg="[DEBUG 2025-06-13T12:26:48.794Z] Upload successful for small-100KB.txt, took 8148ms, file ID: b2cb0bac-5776-433a-a41a-da78beb21e7f" source=console

running (1m20.8s), 2/3 VUs, 13 complete and 0 interrupted iterations
default ↓ [ 100% ] 3 VUs  1m0s

running (1m21.8s), 2/3 VUs, 13 complete and 0 interrupted iterations
default ↓ [ 100% ] 3 VUs  1m0s
time="2025-06-13T12:26:50Z" level=info msg="[DEBUG 2025-06-13T12:26:50.670Z] Upload successful for small-100KB.txt, took 9848ms, file ID: 87dabc2c-b9b3-45cd-b620-1599f9c3b963" source=console

running (1m22.8s), 1/3 VUs, 14 complete and 0 interrupted iterations
default ↓ [ 100% ] 3 VUs  1m0s

running (1m23.8s), 1/3 VUs, 14 complete and 0 interrupted iterations
default ↓ [ 100% ] 3 VUs  1m0s
time="2025-06-13T12:26:53Z" level=info msg="[DEBUG 2025-06-13T12:26:53.079Z] Upload successful for small-100KB.txt, took 4631ms, file ID: 91f40b49-5076-44ae-b558-02dc1aca43f3" source=console


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<60000' p(95)=8.65s

    http_req_failed
    ✗ 'rate<0.10' rate=13.33%

    success_rate
    ✗ 'rate>0.90' rate=86.66%


  █ TOTAL RESULTS 

    CUSTOM
    connection_time.........................................................: avg=60.507809   min=0           med=0           max=320.402153  p(90)=297.606702  p(95)=315.643127  p(99)=319.450348 
    success_rate............................................................: 86.66%  13 out of 15
    time_to_first_byte......................................................: avg=5354.360334 min=4130.679772 med=4733.108085 max=9846.075795 p(90)=7477.399589 p(95)=8655.095395 p(99)=9607.879715
    upload_duration.........................................................: avg=5555.733333 min=4240        med=5134        max=9848        p(90)=7480.4      p(95)=8658        p(99)=9610       
    uploaded_bytes..........................................................: 1536000 18225.013428/s

    HTTP
    http_req_duration.......................................................: avg=5.41s       min=4.23s       med=4.73s       max=9.84s       p(90)=7.47s       p(95)=8.65s       p(99)=9.6s       
      { expected_response:true }............................................: avg=5.45s       min=4.23s       med=4.62s       max=9.84s       p(90)=7.81s       p(95)=8.82s       p(99)=9.64s      
    http_req_failed.........................................................: 13.33%  2 out of 15
    http_reqs...............................................................: 15      0.177979/s

    EXECUTION
    iteration_duration......................................................: avg=14.65s      min=12.76s      med=14.32s      max=17.2s       p(90)=16.53s      p(95)=16.95s      p(99)=17.15s     
    iterations..............................................................: 15      0.177979/s
    vus.....................................................................: 1       min=1          max=3
    vus_max.................................................................: 3       min=3          max=3

    NETWORK
    data_received...........................................................: 20 kB   243 B/s
    data_sent...............................................................: 1.5 MB  18 kB/s



running (1m24.3s), 0/3 VUs, 15 complete and 0 interrupted iterations
default ✓ [ 100% ] 3 VUs  1m0s
time="2025-06-13T12:26:53Z" level=error msg="thresholds on metrics 'http_req_failed, success_rate' have been crossed"